## Exercises I

In [1]:
import pandas as pd
import numpy as np

from env import get_db_url

url = get_db_url('employees')

### Intentionally make a typo in the database url. What kind of error message do you see?

In [ ]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

OperationalError: (pymysql.err.OperationalError) (1044, "Access denied for user 'mirzakhani_1935'@'%' to database 'x'")
(Background on this error at: https://sqlalche.me/e/14/e3q8)

### Intentionally make an error in your SQL query. What does the error message look like?

In [ ]:
pd.read_sql('SELECT * FROM emplyees LIMIT 5 OFFSET 50', url)

ProgrammingError: (pymysql.err.ProgrammingError) (1146, "Table 'employees.emplyees' doesn't exist")
[SQL: SELECT * FROM emplyees LIMIT 5 OFFSET 50]
(Background on this error at: https://sqlalche.me/e/14/f405)

### Read the employees and titles tables into two separate DataFrames.

In [2]:
employees_df = pd.read_sql('SELECT * FROM employees', url)
titles_df = pd.read_sql('SELECT * FROM titles', url)

In [3]:
employees_df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

### How many rows and columns do you have in each DataFrame? Is that what you expected?

I guess. It will be a lot of employees.

In [4]:
employees_df.shape

(300024, 6)

### Display the summary statistics for each DataFrame.

In [5]:
employees_df.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [6]:
employees_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

In [7]:
titles_df.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [8]:
titles_df.shape

(443308, 4)

In [9]:
titles_df.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [10]:
titles_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

### How many unique titles are in the titles DataFrame?

In [11]:
list(titles_df['title'].unique())

['Senior Engineer',
 'Staff',
 'Engineer',
 'Senior Staff',
 'Assistant Engineer',
 'Technique Leader',
 'Manager']

### What is the oldest date in the to_date column?

In [12]:
titles_df['to_date'].min()

datetime.date(1985, 3, 1)

### What is the most recent date in the to_date column?

In [13]:
titles_df['to_date'].max()

datetime.date(9999, 1, 1)

## Exercises II

### 1. Copy the users and roles DataFrames from the examples above.

### 2. What is the result of using a right join on the DataFrames?

### 3. What is the result of using an outer join on the DataFrames?

### 4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

### 5. Load the mpg dataset from PyDataset.

### 6. Output and read the documentation for the mpg dataset.

### 7. How many rows and columns are in the dataset?

### 8. Check out your column names and perform any cleanup you may want on them.

### 9. Display the summary statistics for the dataset.

### 10. How many different manufacturers are there?

### 11. How many different models are there?

### 12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

### 13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

### 14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

### 15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

### 16. Do automatic or manual cars have better miles per gallon?